blog/how-to-know-the-password-saved-by-navicat-preminum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何知道Navicat Premium保存的密码</title>
<!-- 2019-08-24 Sat 21:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">如何知道Navicat Premium保存的密码</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 不同数据类型保存的windows注册表路径位置</a></li>
<li><a href="#sec-2">2. 如何解密</a></li>
</ul>
</div>
</div>
<p>
前几天需要用到一个数据库的密码，但是却无论如何也找不到之前存在哪了（顺便说下，把密码写着纸上或是某个文件里实在是个蠢主意）。想起之前看到过一篇关于<a href="https://github.com/DoubleLabyrinth/how-does-navicat-encrypt-password">navicat是如何加密的文章</a> ，于是找来翻看，并成功把密码复现。为了再稍微深入了解下那篇文章，所以也就有了这篇文章。
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 不同数据类型保存的windows注册表路径位置</h2>
<div class="outline-text-2" id="text-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Database Type</th>
<th scope="col" class="left">Path</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">MySQL</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\Navicat\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">MariaDB</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatMARIADB\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">MongoDB</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatMONGODB\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">Microsoft SQL</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatMSSQL\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">Oracle</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatOra\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">PostgreSQL</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatPG\\Servers\\`&lt;your connection name&gt;`</td>
</tr>

<tr>
<td class="left">SQLite</td>
<td class="left">HKEY_CURRENT_USER\\Software\\PremiumSoft\\NavicatSQLite\\Servers\\`&lt;your connection name&gt;`</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 如何解密</h2>
<div class="outline-text-2" id="text-2">
<p>
作者写了个python脚本，不过你需要确保安装了Python3和依赖模块。
</p>

<p>
模块安装
</p>
<pre class="example">
pip3 install pycryptodome
</pre>

<p>
加解密脚本
</p>
<pre class="example">
#!/usr/bin/env python3
import sys
from Crypto.Hash import SHA1
from Crypto.Cipher import AES, Blowfish

class Navicat11Crypto:

    @staticmethod
    def _XorBytes(a : bytes, b : bytes):
        return bytes([ i ^ j for i, j in zip(a, b) ])

    def __init__(self, Key = b'3DC5CA39'):
        self._CipherKey = SHA1.new(Key).digest()
        self._Cipher = Blowfish.new(self._CipherKey, Blowfish.MODE_ECB)
        self._IV = self._Cipher.encrypt(b'\xFF\xFF\xFF\xFF\xFF\xFF\xFF\xFF')

    def EncryptString(self, s : str):
        if type(s) != str:
            raise TypeError('Parameter s must be a str.')
        else:
            plaintext = s.encode('utf-8')
            ciphertext = b''
            cv = self._IV
            full_round, left_length = divmod(len(plaintext), 8)

            for i in range(0, full_round * 8, 8):
                t = Navicat11Crypto._XorBytes(plaintext[i:i + 8], cv)
                t = self._Cipher.encrypt(t)
                cv = Navicat11Crypto._XorBytes(cv, t)
                ciphertext += t
            
            if left_length != 0:
                cv = self._Cipher.encrypt(cv)
                ciphertext += Navicat11Crypto._XorBytes(plaintext[8 * full_round:], cv[:left_length])

            return ciphertext.hex().upper()

    def DecryptString(self, s : str):
        if type(s) != str:
            raise TypeError('Parameter s must be str.')
        else:
            plaintext = b''
            ciphertext = bytes.fromhex(s)
            cv = self._IV
            full_round, left_length = divmod(len(ciphertext), 8)

            for i in range(0, full_round * 8, 8):
                t = self._Cipher.decrypt(ciphertext[i:i + 8])
                t = Navicat11Crypto._XorBytes(t, cv)
                plaintext += t
                cv = Navicat11Crypto._XorBytes(cv, ciphertext[i:i + 8])
            
            if left_length != 0:
                cv = self._Cipher.encrypt(cv)
                plaintext += Navicat11Crypto._XorBytes(ciphertext[8 * full_round:], cv[:left_length])
            
            return plaintext.decode('utf-8')

class Navicat12Crypto(Navicat11Crypto):

    @staticmethod
    def _Pkcs7Padding(Data : bytes, BlockSize : int):
        return Data + (BlockSize - len(Data) % BlockSize) * bytes([BlockSize - len(Data) % BlockSize])

    @staticmethod
    def _Pkcs7Unpadding(Data):
        return Data[0:-Data[-1]]

    def __init__(self):
        super().__init__()

    def EncryptStringForNCX(self, s : str):
        cipher = AES.new(b'libcckeylibcckey', AES.MODE_CBC, iv = b'libcciv libcciv ')
        padded_plaintext = Navicat12Crypto._Pkcs7Padding(s.encode('utf-8'), AES.block_size)
        return cipher.encrypt(padded_plaintext).hex().upper()

    def DecryptStringForNCX(self, s : str):
        cipher = AES.new(b'libcckeylibcckey', AES.MODE_CBC, iv = b'libcciv libcciv ')
        padded_plaintext = cipher.decrypt(bytes.fromhex(s))
        return Navicat12Crypto._Pkcs7Unpadding(padded_plaintext).decode('utf-8')

if __name__ == '__main__':

    def Help():
        print('Usage:')
        print('    NavicatCrypto.py &lt;enc|dec&gt; [-ncx] &lt;plaintext|ciphertext&gt;')
        print('')
        print('    &lt;enc|dec&gt;                "enc" for encryption, "dec" for decryption.')
        print('                             This parameter must be specified.')
        print('')
        print('    [-ncx]                   Indicate that plaintext/ciphertext is')
        print('                             prepared for/exported from NCX file.')
        print('                             This parameter is optional.')
        print('')
        print('    &lt;plaintext|ciphertext&gt;   Plaintext string or ciphertext string.')
        print('                             NOTICE: Ciphertext string must be a hex string.')
        print('                             This parameter must be specified.')
        print('')

    def Main(argc : int, argv : list):
        if argc == 3:
            if argv[1].lower() == 'enc':
                print(Navicat11Crypto().EncryptString(argv[2]))
            elif argv[1].lower() == 'dec':
                print(Navicat11Crypto().DecryptString(argv[2]))
            else:
                Help()
                return -1
        elif argc == 4:
            if argv[1].lower() == 'enc' and argv[2].lower() == '-ncx':
                print(Navicat12Crypto().EncryptStringForNCX(argv[3]))
            elif argv[1].lower() == 'dec' and argv[2].lower() == '-ncx':
                print(Navicat12Crypto().DecryptStringForNCX(argv[3]))
            else:
                Help()
                return -1
        else:
            Help()
        
        return 0

    exit(Main(len(sys.argv), sys.argv))
</pre>

<p>
也可以直接下载该脚本，记得有时间给作者点个赞哟。
</p>
<pre class="example">
wget https://github.com/DoubleLabyrinth/how-does-navicat-encrypt-password/blob/master/python3/NavicatCipher.py
</pre>

<p>
如何使用呢？
把下面dec后面的字符串换成你注册表里Pwd里的，然后执行下面命令
</p>
<pre class="example">
./NavicatCipher.py dec 0EA71F51DD37BFB60CCBA219BE3A
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>